# NaN not a number

In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [4]:
n = np.nan
type(n)

float

In [5]:
m=1
m + n

nan

# Nan in Series

In [6]:
s1 = Series([1,2,np.nan,3,4],index=['A','B','C','D','E'])

In [7]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [9]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [11]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# Nan in DataFrame

In [12]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [13]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [14]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [23]:
df1 = dframe.dropna(axis=0,how='any') 
#axis=0删除行中有nan的元素，axis=1时删除列中有nan的元素
# all会删掉含有nan的元素，all会删除全部是nan的元素

In [24]:
df1

     0    1    2
0  1.0  2.0  3.0

In [18]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [28]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [29]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [32]:
df2 = dframe2.dropna(thresh=2)

In [33]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [41]:
dframe2.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [43]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0